hh = {
    'woman' => ['женщина', 'служанка', 'любовница', 'уборщица'],
    'women' => ['женщины', 'женский пол'],
    'boy' => ['мальчик', 'парень', 'сын', 'юнга'],
    'dog' => ['собака', 'пес' , 'зажим', 'захват', 'поводок'],
    'paper' => ['бумага','документ','статья','обои','векселя']
}

while true
print "Напишите слово для перевода: "
word = gets.strip
if hh.key?(word)
    #puts "Перевод слова #{word} - #{hh[word]} "
    puts "Варианты перевода слова #{word}"
    hh[word].each_with_index do |val,i|
        puts "Вариант:#{i+1} #{val}"
    end
    puts "Кол-во вариантов - #{hh[word].count}"
else
    puts "Слово #{word} - не найдено!"
end
end
